nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSAIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSAIPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port A */
        PORTA,
        /* Digital filter is configured for PORTA0 */
          PORT_DFER_DFE_11_MASK
            /* Digital filter is configured for PORTA1 */
            | PORT_DFER_DFE_12_MASK
            /* Digital filter is configured for PORTA2 */
            | PORT_DFER_DFE_14_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t SAI0_SYNC = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as SAI0_SYNC */
                                         kPORT_MuxAlt6,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTA11 (pin 135) is configured as SAI0_SYNC */
    PORT_SetPinConfig(BOARD_INITSAIPINS_SAI0_SYNC_PORT, BOARD_INITSAIPINS_SAI0_SYNC_PIN, &SAI0_SYNC);

    const port_pin_config_t SAI0_BCLK = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as SAI0_BCLK */
                                         kPORT_MuxAlt7,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTA12 (pin 134) is configured as SAI0_BCLK */
    PORT_SetPinConfig(BOARD_INITSAIPINS_SAI0_BCLK_PORT, BOARD_INITSAIPINS_SAI0_BCLK_PIN, &SAI0_BCLK);

    const port_pin_config_t porta14_pin127_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Passive filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Pin is configured as SAI0_D3 */
                                                     kPORT_MuxAlt7,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORTA14 (pin 127) is configured as SAI0_D3 */
    PORT_SetPinConfig(PORTA, 14U, &porta14_pin127_config);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port E */
        PORTE,
        /* Digital filter is configured for PORTE0 */
        PORT_DFER_DFE_1_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t porte1_pin137_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as SAI0_D1 */
                                                    kPORT_MuxAlt7,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTE1 (pin 137) is configured as SAI0_D1 */
    PORT_SetPinConfig(PORTE, 1U, &porte1_pin137_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
